In [1]:
import pandas as pd 
import numpy as np

##### In this Notebook we will see how to handle the missing data and cleanse our data or convert to a diiferent data type

In [2]:
# First of all we will see how to drop the missing values


# Let us just create a dictioinary to understand about the DataFrame.

people = {
    "first": ["Corey", "Jane", "John", "Chris", np.nan, None, 'NA'],
    "last" : ["Schafer", 'Doe', "Doe", 'Schafer', np.nan, np.nan, 'Missing'],
    "email" : ["CoreyMSchafer@gmail.com", "JanDoe@email.com", "JohnDoe@email.com", None, np.nan, 'Anonymous@email.com', 'NA'],
    "age" :['33', '35', '63', '36', None, None, 'Missing']
}


# In this dict We can visualise the keys as the column's descripton and the values as the data of those column , then we can visualise that each row of values is meant for a single person in this case. We can Make this dict be represented as rows and columns by using Pandas.
df_example1 = pd.DataFrame(people)




# Go to cell 8 To see what these do
df_example1.replace('NA', np.nan, inplace = True)
df_example1.replace('Missing', np.nan, inplace = True)
len(people)

4

In [3]:
df_example1

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe         JanDoe@email.com    35
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [4]:
# One thing you might wanna do with the missing data is to remove that, We will use the drop Na method to do so 
# So we can do data analysis of our leftour genuine data easily
# We will be running this without any arguements 
df_example1.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe         JanDoe@email.com  35
2   John      Doe        JohnDoe@email.com  63

In [5]:
# dropna() is filling in some default arguements what it is doing in the background,
# Our axis arguement can be sety to the index or the column, this will tell pandas that we wanna drop the missing values when our row contains NaN or None.
# if we set this as column it will then drop columns if they have missing values 
# Now 2nd arguement is how we wanna drop these, this is a criteria of dropping a row or a column , now it is set to any
# that means it will drop our row with any missing value, and now if we pass 'all' insted of 'any', now it will only drop our
# rows when all its values are ,missing
df_example1.dropna(axis = 'index', how = 'any')

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe         JanDoe@email.com  35
2   John      Doe        JohnDoe@email.com  63

In [6]:
# Suppose we wanna do some analysis and they dont have a first name or last name but we really need a email address
# but if the dont have the email address we really have to drop those rows, now to do this we can pass in a subset arguement
# this subset will be the column names in which we will be checking values
df_example1.dropna(axis = 'index', how = 'any', subset = ['email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe         JanDoe@email.com    35
2   John      Doe        JohnDoe@email.com    63
5   None      NaN      Anonymous@email.com  None

In [7]:
# Now what if we want either email or last name not both
df_example1.dropna(axis = 'index', how = 'all', subset = ['email','last'])
# Here the row will be dropped if both the columns in subset are missing that is beacuse we pass 'all' in how

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe         JanDoe@email.com    35
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

############

##### Now we wanna deal with custom missing data, we someone pass NA or none as a string didnt know what to do with the data they 
##### doesnt wanna fill up
##### This depends on how we loaded our data here we created our dataframe from scratch, so we can simply replace those values by
##### NaN values here. we will replace these values by proper numpy NaN values

In [8]:
# To get info if one value is nan or not we can use isna
df_example1.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [9]:
# Sometimes we are working up with numerical data and we wanna replace nan value with certain type of data
# suppose you wanna score some assignments of students in which some students didnt show up so that value would be nan
# But to calculate result we would have to chnage them in obvious numerical value of 0 we can use .fillna() method
df_example1.fillna(0) # All of nan values will get filled with 0 and set inplace = True to set that permanent

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe         JanDoe@email.com  35
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

###### Also what if we wanna cast the data type of our data, in this dataframe we have age and we wanna calculate average age
###### so we are supposed to change the Data type of the age into int.
###### When we have NaN values in a column  we are trying to convert into numbers then you need to use the float data type.
######  because the nan value is actually a float under the hood

In [10]:
type(np.nan)

float

In [11]:
# We will use astype method to cast data type here to float as int will give us error
df_example1['age'] = df_example1['age'].astype(float)

In [12]:
# Mean of ages, converting missing values to 0 would be bad idea because we are gonna calculate mean, which will have anomalies
df_example1['age'].mean()

41.75

## Using stackoverflow survey data

In [13]:
# As talked about earlier if we have some custom missing values we are gonna pass them during reading the csv file as a list here.
# Using the arguement na_values in read_csv() method


na_vals = ['NA', 'Missing']
df = pd.read_csv('data/survey_results_public.csv', index_col = 'Respondent', na_values = na_vals)
schema_df = pd.read_csv('data/survey_results_schema.csv', index_col = 'Column')

In [14]:
pd.set_option('display.max_columns', 85) # Setting options to see the number of desired rows and coloumns of data.
pd.set_option('display.max_rows', 85)

In [15]:
# Now looking at some interesting problem of casting some values, suppose we wanna calculate the average number of years of 
# coding experience among all of them, 

# df['YearsCode'] = df['YearsCode'].astype(float) 


#  This will show error beacuse we have other values of string also

In [16]:
# So let us see all the unique values of this column so we can see whats exactly in there so we can see other strings too
# If we wanna see unique values of the series we can use unique method or values_count()
df['YearsCode'].unique()


# As we expect there aer lots of numbers but there are 2 other unique strings values also, we will replace those with numbers
# Lets replace less than 1 year with 0

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [17]:
df['YearsCode'].replace('Less than 1 year', 0, inplace = True)

In [18]:
df['YearsCode'].replace('More than 50 years', 51, inplace = True)

In [19]:
df['YearsCode'].fillna(0, inplace = True)

In [20]:
df['YearsCode'] = df['YearsCode'].astype(float)

In [21]:
df['YearsCode'].mean()
# Average years of coding.

11.53812315065873

In [22]:
df['YearsCode'].median()

9.0